In [1]:
import pandas as pd
import numpy as np

In [11]:
d = {"Dept":["CSE","EEE","CSE","EEE","ECE","CSE","ECE","EEE","CSE","EEE"],
     "Salary":[10000, 30000, 20000, 20000, 10000, 40000, 30000, 50000, 20000, 10000]}

In [12]:
print(d.values())

dict_values([['CSE', 'EEE', 'CSE', 'EEE', 'ECE', 'CSE', 'ECE', 'EEE', 'CSE', 'EEE'], [10000, 30000, 20000, 20000, 10000, 40000, 30000, 50000, 20000, 10000]])

In [15]:
df = pd.DataFrame(d)
df

  Dept  Salary
0  CSE   10000
1  EEE   30000
2  CSE   20000
3  EEE   20000
4  ECE   10000
5  CSE   40000
6  ECE   30000
7  EEE   50000
8  CSE   20000
9  EEE   10000

In [19]:
df.groupby("Dept").sum().reset_index()

  Dept  Salary
0  CSE   90000
1  ECE   40000
2  EEE  110000

In [29]:
df.groupby("Dept")["Salary"].max().reset_index()

  Dept  Salary
0  CSE   40000
1  ECE   30000
2  EEE   50000

In [39]:
df.loc[:, "Salary"]

0    10000
1    30000
2    20000
3    20000
4    10000
5    40000
6    30000
7    50000
8    20000
9    10000
Name: Salary, dtype: int64

In [46]:
df.iloc[:, 0]

0    CSE
1    EEE
2    CSE
3    EEE
4    ECE
5    CSE
6    ECE
7    EEE
8    CSE
9    EEE
Name: Dept, dtype: object

In [47]:
import datetime

In [53]:
datetime.datetime.now()

datetime.datetime(2024, 3, 18, 13, 49, 8, 401620)

In [55]:
datetime.datetime.today()

datetime.datetime(2024, 3, 18, 13, 49, 29, 451913)

In [95]:
dates = ["2000-4-26", "2001-5-13",'2019-7-19','1994-3-12','2022-9-30','2000-5-24','2005-8-31','2009-1-22',"2000-7-23", "2001-6-16"]

In [96]:
df["date"] = dates

In [97]:
df = df.drop(columns="date_time", axis = 1)

KeyError: "['date_time'] not found in axis"

In [98]:
df

  Dept  Salary       date
0  CSE   10000  2000-4-26
1  EEE   30000  2001-5-13
2  CSE   20000  2019-7-19
3  EEE   20000  1994-3-12
4  ECE   10000  2022-9-30
5  CSE   40000  2000-5-24
6  ECE   30000  2005-8-31
7  EEE   50000  2009-1-22
8  CSE   20000  2000-7-23
9  EEE   10000  2001-6-16

In [99]:
df.dtypes

Dept      object
Salary     int64
date      object
dtype: object

In [85]:
df["date"] = pd.to_datetime(df["date"])
df

  Dept  Salary       date
0  CSE   10000 2000-04-26
1  EEE   30000 2001-05-13
2  CSE   20000 2019-07-19
3  EEE   20000 1994-03-12
4  ECE   10000 2022-09-30
5  CSE   40000 2000-05-24
6  ECE   30000 2005-08-31
7  EEE   50000 2009-01-22
8  CSE   20000 2000-07-23
9  EEE   10000 2001-06-16

In [86]:
df.dtypes

Dept              object
Salary             int64
date      datetime64[ns]
dtype: object

In [107]:
df["Extract_date"] = [datetime.datetime.strptime(d, "%Y-%m-%d") for d in df["date"]]

In [108]:
df

  Dept  Salary       date Extract_date
0  CSE   10000  2000-4-26   2000-04-26
1  EEE   30000  2001-5-13   2001-05-13
2  CSE   20000  2019-7-19   2019-07-19
3  EEE   20000  1994-3-12   1994-03-12
4  ECE   10000  2022-9-30   2022-09-30
5  CSE   40000  2000-5-24   2000-05-24
6  ECE   30000  2005-8-31   2005-08-31
7  EEE   50000  2009-1-22   2009-01-22
8  CSE   20000  2000-7-23   2000-07-23
9  EEE   10000  2001-6-16   2001-06-16

In [120]:

for i, v in enumerate(df["Extract_date"]):
    df[i] = v.day
    df[i] = v.month
    df[i] = v.year

In [131]:
df

  Dept  Salary       date Extract_date
0  CSE   10000  2000-4-26   2000-04-26
1  EEE   30000  2001-5-13   2001-05-13
2  CSE   20000  2019-7-19   2019-07-19
3  EEE   20000  1994-3-12   1994-03-12
4  ECE   10000  2022-9-30   2022-09-30
5  CSE   40000  2000-5-24   2000-05-24
6  ECE   30000  2005-8-31   2005-08-31
7  EEE   50000  2009-1-22   2009-01-22
8  CSE   20000  2000-7-23   2000-07-23
9  EEE   10000  2001-6-16   2001-06-16

In [132]:
df.dtypes

Dept                    object
Salary                   int64
date                    object
Extract_date    datetime64[ns]
dtype: object

In [138]:
datetime.datetime.strptime("2000-11-23","%Y-%m-%d").day
datetime.datetime.strptime("2000-11-23","%Y-%m-%d").month
datetime.datetime.strptime("2000-11-23","%Y-%m-%d").year

2000

In [150]:
for i in df["date"]:
    print(datetime.datetime.strptime(i,"%Y-%m-%d").day)
    print(datetime.datetime.strptime(i, "%Y-%m-%d").month)
    print(datetime.datetime.strptime(i, "%Y-%m-%d").year)

26
4
2000
13
5
2001
19
7
2019
12
3
1994
30
9
2022
24
5
2000
31
8
2005
22
1
2009
23
7
2000
16
6
2001

In [155]:
df = df.drop(columns=df.iloc[:,4:], axis = 1)

In [161]:
df["Day"] = df["Extract_date"].dt.day
df["Month"] = df["Extract_date"].dt.month
df["Year"] = df["Extract_date"].dt.year
df

  Dept  Salary       date Extract_date  Day  Month  Year
0  CSE   10000  2000-4-26   2000-04-26   26      4  2000
1  EEE   30000  2001-5-13   2001-05-13   13      5  2001
2  CSE   20000  2019-7-19   2019-07-19   19      7  2019
3  EEE   20000  1994-3-12   1994-03-12   12      3  1994
4  ECE   10000  2022-9-30   2022-09-30   30      9  2022
5  CSE   40000  2000-5-24   2000-05-24   24      5  2000
6  ECE   30000  2005-8-31   2005-08-31   31      8  2005
7  EEE   50000  2009-1-22   2009-01-22   22      1  2009
8  CSE   20000  2000-7-23   2000-07-23   23      7  2000
9  EEE   10000  2001-6-16   2001-06-16   16      6  2001

In [164]:
df.dtypes

Dept                    object
Salary                   int64
date                    object
Extract_date    datetime64[ns]
Day                      int32
Month                    int32
Year                     int32
dtype: object

In [3]:
pip install python-box==6.0.2

Collecting python-box==6.0.2
  Using cached python_box-6.0.2-py3-none-any.whl.metadata (7.7 kB)
Using cached python_box-6.0.2-py3-none-any.whl (26 kB)
Installing collected packages: python-box
Successfully installed python-box-6.0.2
Note: you may need to restart the kernel to use updated packages.

In [4]:
from box import ConfigBox

In [6]:
d = {"k":"v","k1":"v1"}

In [7]:
d

{'k': 'v', 'k1': 'v1'}

In [9]:
d["k1"]

'v1'

In [10]:
d.k

AttributeError: 'dict' object has no attribute 'k'

In [11]:
d1 = ConfigBox(d)
d1

ConfigBox({'k': 'v', 'k1': 'v1'})

In [12]:
d1.k

'v'

In [13]:
d1.k1

'v1'

In [14]:
d1["k"]

'v'

In [15]:
d1["k1"]

'v1'